In [1]:
import pandas as pd

In [2]:
# lookup table country codes - coordinates
# file is from googlemaps

df_co_from_cc = pd.read_csv('./data/location_ref/countrycodes_coord.csv')

# drop nan rows
df_co_from_cc = df_co_from_cc.dropna(axis='rows')

# remove the second decimal places after the dot for valid latitude and logitude notation
df_co_from_cc['latitude'] = df_co_from_cc['latitude'].str.split('.').str[:-1].str.join('.')
df_co_from_cc['longitude'] = df_co_from_cc['longitude'].str.split('.').str[:-1].str.join('.')

# reame columns
df_co_from_cc = df_co_from_cc.rename({'country': 'COUNTRY_ALPHA2_CODE', 
                                      'latitude': 'country_lat_3857', 
                                      'longitude': 'country_long_3857'}, axis='columns')
df_co_from_cc['country_lat_long_3857'] = df_co_from_cc['country_lat_3857'] + ', ' + df_co_from_cc['country_long_3857']
df_co_from_cc[150:200]

,COUNTRY_ALPHA2_CODE,country_lat_3857,country_long_3857,country_lat_long_3857
150,MU,-20.348,57.552,"-20.348, 57.552"
151,MV,3.202,7.322,"3.202, 7.322"
152,MW,-13.254,34.301,"-13.254, 34.301"
153,MX,23.634,-102.552,"23.634, -102.552"
154,MY,4.210,101.975,"4.210, 101.975"
155,MZ,-18.665,35.529,"-18.665, 35.529"
157,NC,-20.904,165.618,"-20.904, 165.618"
158,NE,17.607,8.081,"17.607, 8.081"
159,NF,-29.040,167.954,"-29.040, 167.954"
160,NG,9.081,8.675,"9.081, 8.675"
161,NI,12.865,-85.207,"12.865, -85.207"
162,NL,52.132,5.291,"52.132, 5.291"
163,NO,60.472,8.468,"60.472, 8.468"
164,NP,28.394,84.124,"28.394, 84.124"
165,NR,-522,166.931,"-522, 166.931"
166,NU,-19.054,-169.867,"-19.054, -169.867"
167,NZ,-40.900,174.885,"-40.900, 174.885"
168,OM,21.512,55.923,"21.512, 55.923"
169,PA,8.537,-80.782,"8.537, -80.782"
170,PE,-9.189,-75.015,"-9.189, -75.015"
171,PF,-17.679,-149.406,"-17.679, -149.406"
172,PG,-6.314,14.395,"-6.314, 14.395"
173,PH,12.879,121.774,"12.879, 121.774"
174,PK,30.375,69.345,"30.375, 69.345"
175,PL,51.919,19.145,"51.919, 19.145"
176,PM,46.941,-5.627,"46.941, -5.627"
177,PN,-24.703,-127.439,"-24.703, -127.439"
178,PR,18.220,-66.590,"18.220, -66.590"
179,PS,31.952,35.233,"31.952, 35.233"
180,PT,39.399,-8.224,"39.399, -8.224"
181,PW,751,13.458,"751, 13.458"
182,PY,-23.442,-58.443,"-23.442, -58.443"
183,QA,25.354,51.183,"25.354, 51.183"
184,RE,-21.115,55.536,"-21.115, 55.536"
185,RO,45.943,24.966,"45.943, 24.966"
186,RS,44.016,21.005,"44.016, 21.005"
187,RU,6.152,105.318,"6.152, 105.318"
188,RW,-1.940,29.873,"-1.940, 29.873"
189,SA,23.885,45.079,"23.885, 45.079"
190,SB,-964,160.156,"-964, 160.156"
191,SC,-4.679,55.491,"-4.679, 55.491"
192,SD,12.862,30.217,"12.862, 30.217"
193,SE,60.128,18.643,"60.128, 18.643"
194,SG,1.352,103.819,"1.352, 103.819"
195,SH,-24.143,-10.030,"-24.143, -10.030"
196,SI,46.151,14.995,"46.151, 14.995"
197,SJ,77.553,23.670,"77.553, 23.670"
198,SK,48.669,19.699,"48.669, 19.699"
199,SL,8.460,-11.779,"8.460, -11.779"
200,SM,4.394,12.457,"4.394, 12.457"

In [3]:
# NO TRANSFORM FOR NOW


# # test the Transformer
# from pyproj import Transformer
# transformer = Transformer.from_crs('epsg:3857','epsg:4326')
# transformer.transform(47.516, 14.550)



# from pyproj import Transformer

# def trans_func(lat_long_string) -> str:
#     """transform coordinate system
    
#     Parameters:
#     ---------
#     lat_long_string: e.g. '-38.416, -63.616'
    
#     """    
#     # instantiate transformer
#     transformer = Transformer.from_crs('epsg:3857','epsg:4326')
    
#     lat_str = lat_long_string.split(',')[0]
#     long_str = lat_long_string.split(',')[1]
#     transformed = transformer.transform(lat_str, long_str) # returns a tuple
    
#     coords_str = (str(transformed[0])) + ', ' + (str(transformed[1]))
#     return coords_str # in decimal degrees !

In [4]:
# df_co_from_cc['country_coords_4326_dd'] = df_co_from_cc['country_lat_long_3857'].apply(trans_func)

In [5]:
# df_co_from_cc.head()

In [6]:
# merge countryname on alpha2code and country coordinates
df_c_multilingu = pd.read_csv('./data/country_names_multilingual/IP2LOCATION-COUNTRY-MULTILINGUAL.CSV')
df_c_multilingu = df_c_multilingu.drop(columns=['COUNTRY_ALPHA3_CODE', 'COUNTRY_NUMERIC_CODE'])
df_c_multilingu.head()

  LANG  LANG_NAME COUNTRY_ALPHA2_CODE                COUNTRY_NAME
0   AF  AFRIKAANS                  AD                     Andorra
1   AF  AFRIKAANS                  AE  Verenigde Arabiese Emirate
2   AF  AFRIKAANS                  AF                  Afganistan
3   AF  AFRIKAANS                  AG          Antigua en Barbuda
4   AF  AFRIKAANS                  AI                    Anguilla

In [7]:
df_c_multilingu.shape

(20169, 4)

In [8]:
# merge these 2 
df_c = df_c_multilingu.merge(df_co_from_cc, how='left', on='COUNTRY_ALPHA2_CODE',suffixes=(False, False))
df_c.shape

(20169, 7)

In [9]:
df_c.head()

,LANG,LANG_NAME,COUNTRY_ALPHA2_CODE,COUNTRY_NAME,country_lat_3857,country_long_3857,country_lat_long_3857
0,AF,AFRIKAANS,AD,Andorra,42.546,1.601,"42.546, 1.601"
1,AF,AFRIKAANS,AE,Verenigde Arabiese Emirate,23.424,53.847,"23.424, 53.847"
2,AF,AFRIKAANS,AF,Afganistan,3.393,67.709,"3.393, 67.709"
3,AF,AFRIKAANS,AG,Antigua en Barbuda,17.060,-61.796,"17.060, -61.796"
4,AF,AFRIKAANS,AI,Anguilla,18.220,-63.068,"18.220, -63.068"

In [10]:
df_c.to_csv('./data/location_ref/country_multilingu_countrycode_countrycoord.csv')

### import next

In [11]:
df_d = pd.read_csv('./data/location_ref/citynamemulti_councode_cityco_citypop.csv', 
                   dtype={'cityCoords': str },index_col=0)

# reame columns
df_d = df_d.rename({'alpha2Code': 'COUNTRY_ALPHA2_CODE', 
                                      'cityLabel': 'CITY_NAME', 
                                      'cityCoords': 'city_long_lat_3857'}, axis='columns')

/Users/lara/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
/Users/lara/anaconda3/lib/python3.7/site-packages/numpy/lib/arraysetops.py:569: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

In [12]:
df_d.tail(5)

        language  CITY_NAME COUNTRY_ALPHA2_CODE city_long_lat_3857 population
1122233       ja    ラーデンタイン                  AT   Point(13.7 46.8)       5831
1122234       kk  Радентайн                  AT   Point(13.7 46.8)       5831
1122235  kk-arab  رادەنتاين                  AT   Point(13.7 46.8)       5831
1122236  kk-cyrl  Радентайн                  AT   Point(13.7 46.8)       5831
1122237  kk-latn  Radentaýn                  AT   Point(13.7 46.8)       5831

In [13]:
df_d['city_long_lat_3857'] = df_d['city_long_lat_3857'].replace("Point\(", "", regex=True).replace(" ", ", ", regex=True).replace("\)", "", regex=True)

In [14]:
df_d

,language,CITY_NAME,COUNTRY_ALPHA2_CODE,city_long_lat_3857,population
0,nn,Trnava,SK,"17.586211111, 48.37775",65382
1,pl,Trnawa,SK,"17.586211111, 48.37775",65382
2,ps,ترناوا,SK,"17.586211111, 48.37775",65382
3,ro,Trnava,SK,"17.586211111, 48.37775",65382
4,rue,Тырнава,SK,"17.586211111, 48.37775",65382
...,...,...,...,...,...
1122233,ja,ラーデンタイン,AT,"13.7, 46.8",5831
1122234,kk,Радентайн,AT,"13.7, 46.8",5831
1122235,kk-arab,رادەنتاين,AT,"13.7, 46.8",5831
1122236,kk-cyrl,Радентайн,AT,"13.7, 46.8",5831
1122237,kk-latn,Radentaýn,AT,"13.7, 46.8",5831

In [15]:
#df_d['city_long_lat_3857'] = df_d['city_long_lat_3857'].apply(lambda x:pd.Series(x.split()[::-1]))


# converting to string series 
df_d['city_long_lat_3857']= df_d['city_long_lat_3857'].astype(str) 
  
# splitting at occurrence of whitespace 
df_d['city_long_lat_3857']= df_d['city_long_lat_3857'].str.split(",", 1) 
  
# displaying second element from list 
df_d['city_lat_3857']  = df_d['city_long_lat_3857'].str.get(1) 

# displaying first element from list 
df_d['city_long_3857']  = df_d['city_long_lat_3857'].str.get(0)

In [16]:
df_d['city_lat_long_3857'] = df_d['city_lat_3857'] + ", " + df_d['city_long_3857'] 
df_d = df_d.drop(columns='city_long_lat_3857')

In [17]:
df_d.head()

,language,CITY_NAME,COUNTRY_ALPHA2_CODE,population,city_lat_3857,city_long_3857,city_lat_long_3857
0,nn,Trnava,SK,65382,48.37775,17.586211111,"48.37775, 17.586211111"
1,pl,Trnawa,SK,65382,48.37775,17.586211111,"48.37775, 17.586211111"
2,ps,ترناوا,SK,65382,48.37775,17.586211111,"48.37775, 17.586211111"
3,ro,Trnava,SK,65382,48.37775,17.586211111,"48.37775, 17.586211111"
4,rue,Тырнава,SK,65382,48.37775,17.586211111,"48.37775, 17.586211111"

In [18]:
df_co_from_cc.head()

  COUNTRY_ALPHA2_CODE country_lat_3857 country_long_3857 country_lat_long_3857
0                  AD           42.546             1.601         42.546, 1.601
1                  AE           23.424            53.847        23.424, 53.847
2                  AF            3.393            67.709         3.393, 67.709
3                  AG           17.060           -61.796       17.060, -61.796
4                  AI           18.220           -63.068       18.220, -63.068

In [19]:
df_e = df_d.merge(df_co_from_cc, how='left', on='COUNTRY_ALPHA2_CODE',suffixes=(False, False))

In [20]:
df_e.to_csv('./data/location_ref/city_multilingu_citycoord_countrycode_countrycoord.csv')

In [21]:
df_e[2000:2100]

,language,CITY_NAME,COUNTRY_ALPHA2_CODE,population,city_lat_3857,city_long_3857,city_lat_long_3857,country_lat_3857,country_long_3857,country_lat_long_3857
2000,sv,Port Louis,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2001,el,Πορ-Λουί,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2002,be,Порт-Луі,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2003,be-tarask,Порт Луі,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2004,bg,Порт Луи,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
...,...,...,...,...,...,...,...,...,...,...
2095,tt,Порт-Луи,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2096,udm,Порт-Луи,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2097,uk,Порт-Луї,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2098,ur,پورٹ لوئس,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"
2099,uz,Port-Lui,MU,149194,-20.166666666,57.5,"-20.166666666, 57.5",-20.348,57.552,"-20.348, 57.552"

In [22]:
#cols = list(df_e.columns.values)